@echo off
cd /d X:\Windows\System32
pecmd logo -
mode con cols=120 lines=30
color 4f
title Edgeless初始化程序
cls
echo.
echo                            ========================================================
echo                             警告：没有发现合法的Edgeless文件夹！请尝试重新拔插U盘！     
echo                            ========================================================
echo.
echo.
echo.
echo ========================================================================================================================
echo          通常情况下，出现此问题的原因是：
echo.
echo  ·使用了山寨/劣质U盘————————————————请更换U盘
echo  ·下载Edgeless镜像时出现了丢包———————————请使用恰当的方式重新下载镜像并制作
echo  ·安装时修改了默认选项或使用了其他安装方式—————请保持默认选项重新制作启动盘
echo.
echo  ·使用了其他启动方式启动——————————————请将Edgeless文件夹复制到某分区根目录内或根据教程操作，然后重试
echo.
echo 如果您不希望做出变动，您可以采取临时措施：将Edgeless文件夹转移到此电脑上其他分区的根目录内
echo.
echo ========================================================================================================================
echo.
echo       现在，您可以选择 [重试] 或 [忽略此消息] ，做出选择吧：
echo.
echo       1.重试            2.忽略（在桌面上生成“重新加载”并加载应急包）
echo.
set /p a=请输入序号并回车：
if %a%==2 md "X:\users\skipsetup"
exit